In [1]:
import numpy as np
import pandas as pd

In [2]:
a=np.array([1,2,3])
b=pd.Series([1,2,3])
print(a)
print(b)

[1 2 3]
0    1
1    2
2    3
dtype: int64

In [3]:
b= pd.Series()
b

C:\Users\dinot\AppData\Local\Temp\ipykernel_7480\4149532965.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  b= pd.Series()

Series([], dtype: float64)

In [7]:
b=pd.Series([1,2,3])
b[1]

2

In [9]:
a=np.array([1,2,3,4,5])
b=pd.Series(a)
print(b)
b[1:4]

0    1
1    2
2    3
3    4
4    5
dtype: int32

1    2
2    3
3    4
dtype: int32

In [10]:
dict={'p1':0,'p2':1,'p3':2,'p4':3}
s= pd.Series(dict)
s

p1    0
p2    1
p3    2
p4    3
dtype: int64

In [11]:
s['p1']

0

In [12]:
s['p2':]

p2    1
p3    2
p4    3
dtype: int64

In [14]:
s[2]=6666

In [15]:
s

p1       0
p2       1
p3    6666
p4       3
dtype: int64

In [16]:
s['p1']=998
s

p1     998
p2       1
p3    6666
p4       3
dtype: int64

In [17]:
a=np.array([1,2,3,'s'])
a

array(['1', '2', '3', 's'], dtype='<U11')

In [18]:
s=pd.Series(a)
s

0    1
1    2
2    3
3    s
dtype: object

In [20]:
s=pd.DataFrame(s)
s

   0
0  1
1  2
2  3
3  s

In [21]:
s=pd.Series([1,2,3,4,5])
print(s)
s=pd.DataFrame(s)
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64
   0
0  1
1  2
2  3
3  4
4  5

In [22]:
s=pd.Series(["h","efhfe","wduhheu"])
print(s)
s=pd.DataFrame(s)
print(s)

0          h
1      efhfe
2    wduhheu
dtype: object
         0
0        h
1    efhfe
2  wduhheu

In [23]:
dict

{'p1': 0, 'p2': 1, 'p3': 2, 'p4': 3}

In [31]:
dict=[{"Name":"Raja","Mark":50}, {"Name":"Priya","Mark":49},{"Name":"Dhanush","Mark":49},{"Name":"Mega","Mark":49}]
print(dict)

[{'Name': 'Raja', 'Mark': 50}, {'Name': 'Priya', 'Mark': 49}, {'Name': 'Dhanush', 'Mark': 49}, {'Name': 'Mega', 'Mark': 49}]

In [35]:
s= pd.DataFrame(dict)
s

      Name  Mark
0     Raja    50
1    Priya    49
2  Dhanush    49
3     Mega    49

In [36]:
s["Name"]

0       Raja
1      Priya
2    Dhanush
3       Mega
Name: Name, dtype: object

In [40]:
p=[{"Name":["raja","john","max","ben"],"Age":["18","20","21","19"]}]
s=pd.DataFrame(p)
print(s)

                     Name               Age
0  [raja, john, max, ben]  [18, 20, 21, 19]

In [41]:
p={"Name":["raja","john","max","ben"],"Age":["18","20","21","19"]}
s=pd.DataFrame(p)
print(s)

   Name Age
0  raja  18
1  john  20
2   max  21
3   ben  19

In [42]:
a=[[1,"a",5565,"hfffh"],[2,"b",676,"fffh"],[3,"c",86868,"hghl"],[4,"d",868,]]
s=pd.DataFrame(a)
s

   0  1      2      3
0  1  a   5565  hfffh
1  2  b    676   fffh
2  3  c  86868   hghl
3  4  d    868   None

In [4]:
a={"Name":["Abinash","Rajapandi","Megaraj","Dhanush","Maniayya"],"Roll":[1,41,30,12,28],"Age":[18,18,19,19,18],"City":["cdu","vnr","tvm","vlr","pkt"]}
s=pd.DataFrame(a)
s

        Name  Roll  Age City
0    Abinash     1   18  cdu
1  Rajapandi    41   18  vnr
2    Megaraj    30   19  tvm
3    Dhanush    12   19  vlr
4   Maniayya    28   18  pkt

In [51]:
s=pd.DataFrame(a, index= ["P1","P2","P3","P4","P5"])
print(s)

         Name  Roll  Age City
P1    Abinash     1   18  cdu
P2  Rajapandi    41   18  vnr
P3    Megaraj    30   19  tvm
P4    Dhanush    12   19  vlr
P5   Maniayya    28   18  pkt

In [55]:
d={"a":pd.Series([1,2,3], index=['a','b','c']),"b":pd.Series([11,22,33,44], index=['a','b','c','d'])}
a=pd.DataFrame(d)
d

{'a': a    1
 b    2
 c    3
 dtype: int64,
 'b': a    11
 b    22
 c    33
 d    44
 dtype: int64}

In [57]:
d={"a": pd.Series ([1,2,3], index= ['a','b','c']),"b": pd.Series([11,22,33,44], index=['a','b','c','d'])}
a=pd.DataFrame(d)
a

     a   b
a  1.0  11
b  2.0  22
c  3.0  33
d  NaN  44

In [64]:
d={"a": pd.Series ([1,2,3], index= ['a','b','c']),"b": pd.Series([11,22,33,44], index=['a','b','c','d']),'c':pd.Series([1,2,3,4])}
a=pd.DataFrame(d)
a

     a     b    c
a  1.0  11.0  NaN
b  2.0  22.0  NaN
c  3.0  33.0  NaN
d  NaN  44.0  NaN
0  NaN   NaN  1.0
1  NaN   NaN  2.0
2  NaN   NaN  3.0
3  NaN   NaN  4.0

In [7]:
d={"a": pd.Series ([1,2,3], index= ['a','b','c']),"b": pd.Series([11,22,33,44], index=['a','b','c','d'])}
a=pd.DataFrame(d)
a

     a   b
a  1.0  11
b  2.0  22
c  3.0  33
d  NaN  44

In [9]:
import numpy as np
import pandas as pd
d["a"]=pd.Series([1,2,3], index=['a','b','c'])
d

{'a': a    1
 b    2
 c    3
 dtype: int64,
 'b': a    11
 b    22
 c    33
 d    44
 dtype: int64}

In [11]:
d={"a": pd.Series ([1,2,3], index= ['a','b','c']),"b": pd.Series([11,22,33,44], index=['a','b','c','d'])}
a=pd.DataFrame(d)
a

     a   b
a  1.0  11
b  2.0  22
c  3.0  33
d  NaN  44

In [6]:
import numpy as np
import pandas as pd
d["a"]=pd.Series([1,2,3], index=['a','b','c'])
d=pd.DataFrame(d)
print(d)

NameError: name 'd' is not defined

In [16]:
import numpy as np
import pandas as pd
d["a"]=pd.Series([33,433,334], index=['a','b','c'])
d=pd.DataFrame(d)
print(d)

       a   b    c
a   33.0  11  1.0
b  433.0  22  2.0
c  334.0  33  3.0
d    NaN  44  NaN

In [17]:
d['d']=pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
d=pd.DataFrame(d)
print(d)

       a   b    c  d
a   33.0  11  1.0  1
b  433.0  22  2.0  2
c  334.0  33  3.0  3
d    NaN  44  NaN  4

In [24]:
print(d[['a','b']])

       a   b
a   33.0  11
b  433.0  22
c  334.0  33
d    NaN  44

In [25]:
print(d.columns)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [27]:
d.columns[2]

'c'

In [32]:
d.columns[[1,2,0]]

Index(['b', 'c', 'a'], dtype='object')

In [34]:
print(d[d.columns[[1,2,0]]])

    b    c      a
a  11  1.0   33.0
b  22  2.0  433.0
c  33  3.0  334.0
d  44  NaN    NaN

In [39]:
print(d.loc['a'])

a    33.0
b    11.0
c     1.0
d     1.0
Name: a, dtype: float64

In [43]:
dict=[{"Name":"Raja","Mark":50}, {"Name":"Priya","Mark":49},{"Name":"Dhanush","Mark":49},{"Name":"Mega","Mark":49}]
print(dict)
a=pd.DataFrame(dict, index=['r1','r2','r3','r4'])
a

[{'Name': 'Raja', 'Mark': 50}, {'Name': 'Priya', 'Mark': 49}, {'Name': 'Dhanush', 'Mark': 49}, {'Name': 'Mega', 'Mark': 49}]

       Name  Mark
r1     Raja    50
r2    Priya    49
r3  Dhanush    49
r4     Mega    49

In [44]:
print(a.loc['r1'])

Name    Raja
Mark      50
Name: r1, dtype: object

In [47]:
print(a.iloc[1])

Name    Priya
Mark       49
Name: r2, dtype: object

In [48]:
print(a.iloc[1:])

       Name  Mark
r2    Priya    49
r3  Dhanush    49
r4     Mega    49

In [49]:
print(a.index.values)

['r1' 'r2' 'r3' 'r4']

In [51]:
print(a.iloc[0:2,1:3])

    Mark
r1    50
r2    49

In [10]:
a=d.Series(['Raja',20,"A"],["Adhish",20,"A"],["Dhni",18,'A'],columns = ['Name','Age','Grade'])
a

AttributeError: 'dict' object has no attribute 'Series'

In [56]:
a=pd.DataFrame([['Raja',20,"A"],["Adhish",20,"A"],["Dhni",18,'A']],columns = ['Name','Age','Grade'], index=['a1','a2','a3'])
a

      Name  Age Grade
a1    Raja   20     A
a2  Adhish   20     A
a3    Dhni   18     A

In [69]:
b=pd.DataFrame([["Virat",20,"B"],["Zumba",18,'A']],columns= ['Name','Age','Grade'])
b

    Name  Age Grade
0  Virat   20     B
1  Zumba   18     A

In [70]:
a=a.append(b)

C:\Users\dinot\AppData\Local\Temp\ipykernel_2268\1030491723.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a=a.append(b)

In [72]:
a '''done 3 times'''

      Name  Age Grade
a1    Raja   20     A
a2  Adhish   20     A
a3    Dhni   18     A
0    Virat   20     B
1    Zumba   19     A
0    Virat   20     B
1    Zumba   18     A
0    Virat   20     B
1    Zumba   18     A

In [76]:
print(a.loc[0])

    Name  Age Grade
0  Virat   20     B
0  Virat   20     B
0  Virat   20     B

In [77]:
del(a["Name"])
a

    Age Grade
a1   20     A
a2   20     A
a3   18     A
0    20     B
1    19     A
0    20     B
1    18     A
0    20     B
1    18     A

In [78]:
a=a.drop(0)
a

    Age Grade
a1   20     A
a2   20     A
a3   18     A
1    19     A
1    18     A
1    18     A

In [79]:
a=a.reset_index()
a

  index  Age Grade
0    a1   20     A
1    a2   20     A
2    a3   18     A
3     1   19     A
4     1   18     A
5     1   18     A

In [81]:
del(a["index"])
a

   Age Grade
0   20     A
1   20     A
2   18     A
3   19     A
4   18     A
5   18     A

In [93]:
a.drop('Age' , axis=1)

  Grade
0     A
1     A
2     A
3     A
4     A
5     A

In [94]:
a=pd.DataFrame([['Raja',20,"A"],["Adhish",20,"A"],["Dhni",18,'A']],columns = ['Name','Age','Grade'], index=['a1','a2','a3'])
a

      Name  Age Grade
a1    Raja   20     A
a2  Adhish   20     A
a3    Dhni   18     A

In [95]:
x=a.pop("Age")
a

      Name Grade
a1    Raja     A
a2  Adhish     A
a3    Dhni     A

In [96]:
x

a1    20
a2    20
a3    18
Name: Age, dtype: int64

In [97]:
print([x])

[a1    20
a2    20
a3    18
Name: Age, dtype: int64]

In [2]:
import numpy as np
import pandas as pd
d=pd.DataFrame([[1,"Raja","pandi"],[2,'Mega','raj'],[3,'adhish','kumar'],[4,'Mani','ayya'],[5,'ashwin','kumar']], columns= ['Roll_no','F_Name','L_Name'])
d

   Roll_no  F_Name L_Name
0        1    Raja  pandi
1        2    Mega    raj
2        3  adhish  kumar
3        4    Mani   ayya
4        5  ashwin  kumar

In [18]:
f=pd.DataFrame([[1,'Py',18],[2,'HTML',19],[3,'Matlab',19],[5,'Bio',18]], columns=['Roll_no','Domain','Age'])
f

   Roll_no  Domain  Age
0        1      Py   18
1        2    HTML   19
2        3  Matlab   19
3        5     Bio   18

In [19]:
print(pd.concat([d,f]))

   Roll_no  F_Name L_Name  Domain   Age
0        1    Raja  pandi     NaN   NaN
1        2    Mega    raj     NaN   NaN
2        3  adhish  kumar     NaN   NaN
3        4    Mani   ayya     NaN   NaN
4        5  ashwin  kumar     NaN   NaN
0        1     NaN    NaN      Py  18.0
1        2     NaN    NaN    HTML  19.0
2        3     NaN    NaN  Matlab  19.0
3        5     NaN    NaN     Bio  18.0

In [21]:
print(pd.concat([d,f], axis=1))

   Roll_no  F_Name L_Name  Roll_no  Domain   Age
0        1    Raja  pandi      1.0      Py  18.0
1        2    Mega    raj      2.0    HTML  19.0
2        3  adhish  kumar      3.0  Matlab  19.0
3        4    Mani   ayya      5.0     Bio  18.0
4        5  ashwin  kumar      NaN     NaN   NaN

In [22]:
d

   Roll_no  F_Name L_Name
0        1    Raja  pandi
1        2    Mega    raj
2        3  adhish  kumar
3        4    Mani   ayya
4        5  ashwin  kumar

In [23]:
f

   Roll_no  Domain  Age
0        1      Py   18
1        2    HTML   19
2        3  Matlab   19
3        5     Bio   18

In [24]:
pd.merge(d,f, left_on="Roll_no",right_on="Roll_no",how='inner')

   Roll_no  F_Name L_Name  Domain  Age
0        1    Raja  pandi      Py   18
1        2    Mega    raj    HTML   19
2        3  adhish  kumar  Matlab   19
3        5  ashwin  kumar     Bio   18

In [25]:
d

   Roll_no  F_Name L_Name
0        1    Raja  pandi
1        2    Mega    raj
2        3  adhish  kumar
3        4    Mani   ayya
4        5  ashwin  kumar

In [26]:
f=pd.DataFrame([[1,'Py',18],[2,'HTML',19],[3,'Matlab',19],[5,'Bio',18]], columns=['Rollno','Domain','Age'])
f

   Rollno  Domain  Age
0       1      Py   18
1       2    HTML   19
2       3  Matlab   19
3       5     Bio   18

In [27]:
pd.merge(d,f, left_on="Roll_no",right_on="Rollno",how='inner')

   Roll_no  F_Name L_Name  Rollno  Domain  Age
0        1    Raja  pandi       1      Py   18
1        2    Mega    raj       2    HTML   19
2        3  adhish  kumar       3  Matlab   19
3        5  ashwin  kumar       5     Bio   18

In [28]:
 pd.merge(d,f,left_on='Roll_no',right_on='Rollno',how='left')

   Roll_no  F_Name L_Name  Rollno  Domain   Age
0        1    Raja  pandi     1.0      Py  18.0
1        2    Mega    raj     2.0    HTML  19.0
2        3  adhish  kumar     3.0  Matlab  19.0
3        4    Mani   ayya     NaN     NaN   NaN
4        5  ashwin  kumar     5.0     Bio  18.0

In [29]:
pd.merge(d,f,left_on='Roll_no',right_on='Rollno',how='right')

   Roll_no  F_Name L_Name  Rollno  Domain  Age
0        1    Raja  pandi       1      Py   18
1        2    Mega    raj       2    HTML   19
2        3  adhish  kumar       3  Matlab   19
3        5  ashwin  kumar       5     Bio   18

In [30]:
pd.merge(d,f,left_on='Roll_no',right_on="Rollno",how='outer')

   Roll_no  F_Name L_Name  Rollno  Domain   Age
0        1    Raja  pandi     1.0      Py  18.0
1        2    Mega    raj     2.0    HTML  19.0
2        3  adhish  kumar     3.0  Matlab  19.0
3        4    Mani   ayya     NaN     NaN   NaN
4        5  ashwin  kumar     5.0     Bio  18.0

In [32]:
'''EXAMPLE PROGRAM TO PRINT
@@
@@@
@@@@
@
AS AN OUTPUT'''

'EXAMPLE PROGRAM TO PRINT\n@@\n@@@\n@@@@\n@\nAS AN OUTPUT'

In [44]:
def fu(a):
    for i in a:
        n=i
        o=''
        while n>0:
            o+='@'
            n-=1
        print(o)
a=[1,2,3,4,5,6,7]
fu(a)

@
@@
@@@
@@@@
@@@@@
@@@@@@
@@@@@@@

In [51]:
print(pd.merge(d,f,on=['Roll_no','Age'],how='inner'))

KeyError: 'Roll_no'

In [90]:
a=pd.read_csv("D:\Acmegrade\Sources\DemographicData.csv")

In [54]:
import os
os.chdir("D:\Acmegrade\Sources")
os.getcwd()

'D:\\Acmegrade\\Sources'

In [59]:
b=pd.read_csv("tips.csv")

In [60]:
a

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [61]:
b

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [62]:
a.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [63]:
a.head(10)

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9000,High income
1,Afghanistan,AFG,35.253,5.9000,Low income
2,Angola,AGO,45.985,19.1000,Upper middle income
3,Albania,ALB,12.877,57.2000,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0000,High income
5,Argentina,ARG,17.716,59.9000,High income
6,Armenia,ARM,13.308,41.9000,Lower middle income
7,Antigua and Barbuda,ATG,16.447,63.4000,High income
8,Australia,AUS,13.200,83.0000,High income
9,Austria,AUT,9.400,80.6188,High income

In [64]:
a.tail()

,Country Name,Country Code,Birth rate,Internet users,Income Group
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [66]:
a.tail(1)

    Country Name Country Code  Birth rate  Internet users Income Group
194     Zimbabwe          ZWE      35.715            18.5   Low income

In [67]:
b.tail(4)

     total_bill   tip     sex smoker   day    time  size
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [68]:
print(len(a))

195

In [69]:
print(len(b))

244

In [70]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__deprecated_num_index_names',
 '__dir__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_testing',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [71]:
print(a.columns)

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [73]:
print(b.columns)

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [76]:
l=list(a.columns)
print(l)

['Country Name', 'Country Code', 'Birth rate', 'Internet users', 'Income Group']

In [77]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country Name    195 non-null    object
 1   Country Code    195 non-null    object
 2   Birth rate      195 non-null    float64
 3   Internet users  195 non-null    float64
 4   Income Group    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [79]:
a.describe()

       Birth rate  Internet users
count  195.000000      195.000000
mean    21.469928       42.076471
std     10.605467       29.030788
min      7.900000        0.900000
25%     12.120500       14.520000
50%     19.680000       41.000000
75%     29.759500       66.225000
max     49.661000       96.546800

In [80]:
a.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [91]:
a.columns =['c_name','c_code','b_rate','in_user','in_grp']
a.head

<bound method NDFrame.head of                    c_name c_code  b_rate  in_user               in_grp
0                   Aruba    ABW  10.244     78.9          High income
1             Afghanistan    AFG  35.253      5.9           Low income
2                  Angola    AGO  45.985     19.1  Upper middle income
3                 Albania    ALB  12.877     57.2  Upper middle income
4    United Arab Emirates    ARE  11.044     88.0          High income
..                    ...    ...     ...      ...                  ...
190           Yemen, Rep.    YEM  32.947     20.0  Lower middle income
191          South Africa    ZAF  20.850     46.5  Upper middle income
192      Congo, Dem. Rep.    COD  42.394      2.2           Low income
193                Zambia    ZMB  40.471     15.4  Lower middle income
194              Zimbabwe    ZWE  35.715     18.5           Low income

[195 rows x 5 columns]>

In [92]:
a

                   c_name c_code  b_rate  in_user               in_grp
0                   Aruba    ABW  10.244     78.9          High income
1             Afghanistan    AFG  35.253      5.9           Low income
2                  Angola    AGO  45.985     19.1  Upper middle income
3                 Albania    ALB  12.877     57.2  Upper middle income
4    United Arab Emirates    ARE  11.044     88.0          High income
..                    ...    ...     ...      ...                  ...
190           Yemen, Rep.    YEM  32.947     20.0  Lower middle income
191          South Africa    ZAF  20.850     46.5  Upper middle income
192      Congo, Dem. Rep.    COD  42.394      2.2           Low income
193                Zambia    ZMB  40.471     15.4  Lower middle income
194              Zimbabwe    ZWE  35.715     18.5           Low income

[195 rows x 5 columns]

In [95]:
a.rename(columns={"c_name":"Country_Name"}, inplace = True)

In [96]:
a

             Country_Name c_code  b_rate  in_user               in_grp
0                   Aruba    ABW  10.244     78.9          High income
1             Afghanistan    AFG  35.253      5.9           Low income
2                  Angola    AGO  45.985     19.1  Upper middle income
3                 Albania    ALB  12.877     57.2  Upper middle income
4    United Arab Emirates    ARE  11.044     88.0          High income
..                    ...    ...     ...      ...                  ...
190           Yemen, Rep.    YEM  32.947     20.0  Lower middle income
191          South Africa    ZAF  20.850     46.5  Upper middle income
192      Congo, Dem. Rep.    COD  42.394      2.2           Low income
193                Zambia    ZMB  40.471     15.4  Lower middle income
194              Zimbabwe    ZWE  35.715     18.5           Low income

[195 rows x 5 columns]

In [97]:
a["Day"]="Sun"

In [98]:
a

             Country_Name c_code  b_rate  in_user               in_grp  Day
0                   Aruba    ABW  10.244     78.9          High income  Sun
1             Afghanistan    AFG  35.253      5.9           Low income  Sun
2                  Angola    AGO  45.985     19.1  Upper middle income  Sun
3                 Albania    ALB  12.877     57.2  Upper middle income  Sun
4    United Arab Emirates    ARE  11.044     88.0          High income  Sun
..                    ...    ...     ...      ...                  ...  ...
190           Yemen, Rep.    YEM  32.947     20.0  Lower middle income  Sun
191          South Africa    ZAF  20.850     46.5  Upper middle income  Sun
192      Congo, Dem. Rep.    COD  42.394      2.2           Low income  Sun
193                Zambia    ZMB  40.471     15.4  Lower middle income  Sun
194              Zimbabwe    ZWE  35.715     18.5           Low income  Sun

[195 rows x 6 columns]

In [99]:
del a['Day']
a

             Country_Name c_code  b_rate  in_user               in_grp
0                   Aruba    ABW  10.244     78.9          High income
1             Afghanistan    AFG  35.253      5.9           Low income
2                  Angola    AGO  45.985     19.1  Upper middle income
3                 Albania    ALB  12.877     57.2  Upper middle income
4    United Arab Emirates    ARE  11.044     88.0          High income
..                    ...    ...     ...      ...                  ...
190           Yemen, Rep.    YEM  32.947     20.0  Lower middle income
191          South Africa    ZAF  20.850     46.5  Upper middle income
192      Congo, Dem. Rep.    COD  42.394      2.2           Low income
193                Zambia    ZMB  40.471     15.4  Lower middle income
194              Zimbabwe    ZWE  35.715     18.5           Low income

[195 rows x 5 columns]

In [108]:
a[a.in_grp=='High income']

              Country_Name c_code  b_rate  in_user       in_grp
0                    Aruba    ABW  10.244    78.90  High income
4     United Arab Emirates    ARE  11.044    88.00  High income
5                Argentina    ARG  17.716    59.90  High income
7      Antigua and Barbuda    ATG  16.447    63.40  High income
8                Australia    AUS  13.200    83.00  High income
..                     ...    ...     ...      ...          ...
174    Trinidad and Tobago    TTO  14.590    63.80  High income
180                Uruguay    URY  14.374    57.69  High income
181          United States    USA  12.500    84.20  High income
184          Venezuela, RB    VEN  19.842    54.90  High income
185  Virgin Islands (U.S.)    VIR  10.700    45.30  High income

[67 rows x 5 columns]

In [109]:
a[(a.in_grp=='High income')&(a.in_user>70)]

             Country_Name c_code  b_rate   in_user       in_grp
0                   Aruba    ABW  10.244  78.90000  High income
4    United Arab Emirates    ARE  11.044  88.00000  High income
8               Australia    AUS  13.200  83.00000  High income
9                 Austria    AUT   9.400  80.61880  High income
12                Belgium    BEL  11.200  82.17020  High income
17                Bahrain    BHR  15.040  90.00004  High income
18           Bahamas, The    BHS  15.339  72.00000  High income
22                Bermuda    BMU  10.400  95.30000  High income
25               Barbados    BRB  12.188  73.00000  High income
30                 Canada    CAN  10.900  85.80000  High income
31            Switzerland    CHE  10.200  86.34000  High income
42         Cayman Islands    CYM  12.500  74.10000  High income
44         Czech Republic    CZE  10.200  74.11040  High income
45                Germany    DEU   8.500  84.17000  High income
47                Denmark    DNK  10.000  94.62970  High income
53                  Spain    ESP   9.100  71.63500  High income
54                Estonia    EST  10.300  79.40000  High income
56                Finland    FIN  10.700  91.51440  High income
58                 France    FRA  12.300  81.91980  High income
61         United Kingdom    GBR  12.200  89.84410  High income
74   Hong Kong SAR, China    HKG   7.900  74.20000  High income
78                Hungary    HUN   9.200  72.64390  High income
81                Ireland    IRL  15.000  78.24770  High income
84                Iceland    ISL  13.400  96.54680  High income
85                 Israel    ISR  21.300  70.80000  High income
89                  Japan    JPN   8.200  89.71000  High income
95            Korea, Rep.    KOR   8.600  84.77000  High income
96                 Kuwait    KWT  20.575  75.46000  High income
102         Liechtenstein    LIE   9.200  93.80000  High income
106            Luxembourg    LUX  11.300  93.77650  High income
107                Latvia    LVA  10.200  75.23440  High income
130           Netherlands    NLD  10.200  93.95640  High income
131                Norway    NOR  11.600  95.05340  High income
133           New Zealand    NZL  13.120  82.78000  High income
141           Puerto Rico    PRI  10.800  73.90000  High income
145                 Qatar    QAT  11.940  85.30000  High income
152             Singapore    SGP   9.300  81.00000  High income
161       Slovak Republic    SVK  10.100  77.88260  High income
162              Slovenia    SVN  10.200  72.67560  High income
163                Sweden    SWE  11.800  94.78360  High income
181         United States    USA  12.500  84.20000  High income

In [111]:
a.in_grp.unique()

array(['High income', 'Low income', 'Upper middle income',
       'Lower middle income'], dtype=object)

In [112]:
import numpy as np
import pandas as pd

a=pd.DataFrame([['Megaraj',99,19],['Raja',100,18],['Dhanush',101,19]], columns= ['Name','Mark','Age'],index=['s1','s2','s3'])
a

       Name  Mark  Age
s1  Megaraj    99   19
s2     Raja   100   18
s3  Dhanush   101   19

In [9]:
import pandas as pd
a={"Mega":"loosukoothi","sugumar":"kirukkukoothi"}
df=pd.DataFrame(a.items())
df

         0              1
0     Mega    loosukoothi
1  sugumar  kirukkukoothi

In [8]:
import pandas as pd

# Create a DataFrame
data = {'Column1': [1, 2, 3],
        'Column2': [4, 5, 6]}

df = pd.DataFrame(data)

# Convert DataFrame to string without index and headers
table_string = df.to_string(header=False, index=False)

1 4
2 5
3 6